# St7GetFaceOutline

Returns the outline colour scheme for faces.

long St7GetFaceOutline(long uID, long* Outline)

Input Parameters

uID

Strand7 model file ID.

Strand7 API Manual

Output Parameters

Outline

One of flNone, flProperty, flGroup, flFaceNumber, flFaceID or flColour.